openfoam/base_case/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water air);

water
{
    transportModel  Newtonian;
    nu              1e-06;       // kinematic viscosity [m^2/s]
    rho             1000;        // density [kg/m^3]
}

air
{
    transportModel  Newtonian;
    nu              1.48e-05;    // kinematic viscosity [m^2/s]
    rho             1;           // density [kg/m^3]
}

sigma           0.07;           // surface tension coefficient [N/m]

// ************************************************************************* //
