openfoam/base_case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         2.5;

deltaT          0.001;

// Adaptive time-stepping: keeps Co < 0.5 for interface stability
adjustTimeStep  yes;
maxCo           0.5;
maxAlphaCo      0.5;
maxDeltaT       0.05;

writeControl    adjustableRunTime;
writeInterval   0.1;            // save every 0.1 s → 26 snapshots

purgeWrite      0;              // keep all time directories
writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable yes;

functions
{
    // Track wave-front and max velocity at run time (optional monitoring)
    fieldMinMax
    {
        type            fieldMinMax;
        libs            (fieldFunctionObjects);
        writeControl    timeStep;
        writeInterval   10;
        fields          (alpha.water U p_rgh);
    }
}

// ************************************************************************* //
