openfoam/base_case/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;          // first-order implicit for stability
}

gradSchemes
{
    default         Gauss linear;
    grad(U)         Gauss linear;
}

divSchemes
{
    default             none;

    // Momentum convection: linearUpwind is 2nd-order with bounded TVD
    div(rhoPhi,U)       Gauss linearUpwind grad(U);

    // VOF interface advection: MULES-corrected vanLeer for sharp interface
    div(phi,alpha)      Gauss vanLeer;
    div(phirb,alpha)    Gauss linear;

    div(((rho*nuEff)*dev2(T(grad(U)))))  Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p_rgh           ;
    pcorr           ;
    alpha.water     ;
}

// ************************************************************************* //
